
function heapSort(arr) {
    /*
        @params {array[number]} arr - массив с числами
    */

    const length = arr.length; // длина массива


    const swap = (i, j) => {
        /** 
            * эта фукция меня элементы списка местами
        
            * @params {number} i - индекс элемента списка
            * @params {number} j - индекс элемента списка
        */
        [arr[i], arr[j]] = [arr[j], arr[i]]
    }

    const shiftDown = (i, size) => {
        /**
            * Функция для просеивания элемента кучи сверху вниз (Sift Down / Heapify).
            * Восстанавливает основное свойство Max-Heap (родитель должен быть больше детей).
            * 
            * @param {number} i - Индекс элемента-нарушителя, который нужно опустить вниз.
            * @param {number} size - Текущий рабочий размер кучи (активная граница массива).
        */

        

        while (true) {
            let largest = i; // Изначально считаем текущий узел самым большим

            const leftChild = i * 2+1; // Индекс левого дочернего элемента
            const rightChild = i * 2+2; // Индекс правого дочернего элемента

             // Проверяем, существует ли левый ребенок и больше ли он текущего лидера
            if (leftChild < size && arr[leftChild] > arr[largest]) {
                largest = leftChild
            } 
            
            // Проверяем, существует ли правый ребенок и больше ли он текущего лидера
            if (rightChild < size && arr[rightChild] > arr[largest]) {
                largest = rightChild
            }

            // Если один из детей оказался больше родителя
            if (largest !== i) {
                swap(i, largest); // Меняем родителя с наибольшим ребенком местами
                i = largest; // Переходим по индексу вниз, чтобы продолжить спуск
            } else {
                break // Если родитель больше всех детей, куча починена — выходим
            }
        }
    }   


    // === 1 ЭТАП: Постройка начальной Max-Heap (пирамиды) ===
    // Стартуем с последнего узла, у которого гарантированно есть дети (length / 2 - 1).
    // Двигаемся назад к началу массива (до корня с индексом 0).
    // На каждом шаге "прокапываем" элемент вниз, чтобы большие числа всплывали наверх.
    for (let i = Math.floor(length / 2) - 1; i >= 0; i--) {
        shiftDown(i, length); // Передаем полный размер массива, так как куча еще не сжимается
    }


    // === 2 ЭТАП: Финальная сортировка массива ===
    // Идем с самого конца массива вниз до индекса 1. 
    // Переменная `end` одновременно служит текущей правой границей нашей активной кучи.
    for (let end = arr.length - 1; end > 0; end--) {
        swap(0, end) // 1. Отправляем текущий максимум (из корня 0) в самый конец активной зоны.
        shiftDown(0, end) // 2. На вершину попал случайный элемент. Просеиваем его вниз.
                          // Передаем размер `end`, чтобы функция не трогала уже отсортированный хвост.
    }

    return arr;
}