// dfs - поиск в глубину

// Базовый шаблон кода 

const runDfsTemplate = (N, graph, start) => {
    /**
        * @param {Number} N - размер графа
        * @param {Array {Number}} graph - наш граф (список смежности)
        * @param {start} start - стартовая вершина
    */

    // массив флагов, что бы не ходить по кругу
    const visited = new Array(N + 1).fill(false);

    // основная рекурсивная функция
    const dfs = (v) => {
        /**
            * @param {Number} v - индекс посещенной вершины 
        */

        // ТОЧКА АДАПТАЦИИ №1: Вход в вершину
        // Здесь мы пишем то, что нужно сделать СРАЗУ, как только зашли на новую страницу/остановку.
    

        visited[v] = true; // отмечаем что мы здесь уже были

        // ВОТ СЮДА МЫ ДОПИСЫВАЕМ СУТЬ ЗАДАЧИ:
        // В задаче №450 (отчёты): нам ничего тут делать было не нужно, просто отметить.
        // В задаче №619 (автобусы): мы пишем тут count++, потому что нашли новую остановку [Query-relevant Context].
        // В задачах на поиск сокровищ: тут проверяют if (node.value === 'gold') { ... }.

        // перебираем всех соседей
        const neighbors = graph[v]|| []; // Если соседей нет, берём пустой массив

        for (let i = 0; i < neighbors.length; i++) {
            const neighbor = neighbors[i];
            // Если у соседа ещё нет нашего флажка — бежим к нему вглубь!
            if (!visited[neighbor]) {
                dfs(neighbor); // Рекурсивный вызов (бег по нитке дальше)
            }
        }

        // ТОЧКА АДАПТАЦИИ №2: Выход из вершины (После цикла)
        // Сюда код доходит, когда робот обошёл ВСЕХ соседей текущего узла и готов вернуться назад.
        // В задаче про АВЛ-деревья мы именно ЗДЕСЬ писали return Math.max(L, R) + 1 [Query-relevant Context],
        // потому что узнать высоту родителя можно ТОЛЬКО после того, как узнали высоту всех его детей!
    }

    dfs(start)
}
